[Killed] BlockStatement
src/controllers/products.controller.js:3:45
 const { productsService } = require('../services');
 
-const getAllProducts = async (_req, res) => {
-    const { message } = await productsService.getAllProducts();
-
-    res.status(200).json(message);
-};
+const getAllProducts = async (_req, res) => {};
 const getProductsByID = async (req, res) => {
         const { id } = req.params;
killedBy: TESTANDO O CONTROLLER PRODUTOS TESTANDO O CONTROLLER PRODUTOS - área de listagem Se realiza corretamente a relação de todos os produtos
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/products.controller.js:8:45
 
     res.status(200).json(message);
 };
-const getProductsByID = async (req, res) => {
-        const { id } = req.params;
-        const { type, message } = await productsService.getID(id);
-
-        if (type) return res.status(404).json({ message });
-
-        res.status(200).json(message);
-};
+const getProductsByID = async (req, res) => {};
 
 const postProduct = async (req, res) => {
killedBy: TESTANDO O CONTROLLER PRODUTOS TESTANDO O CONTROLLER PRODUTOS Se ao digitar um id existente a aplicaçao continua
statusReason: expected stub to have been called with arguments 200

[Killed] ConditionalExpression
src/controllers/products.controller.js:12:13
         const { id } = req.params;
         const { type, message } = await productsService.getID(id);
 
-        if (type) return res.status(404).json({ message });
+        if (true) return res.status(404).json({ message });
 
         res.status(200).json(message);
killedBy: TESTANDO O CONTROLLER PRODUTOS TESTANDO O CONTROLLER PRODUTOS Se ao digitar um id existente a aplicaçao continua
statusReason: expected status to have been called with arguments 200
404 200

[Killed] ConditionalExpression
src/controllers/products.controller.js:12:13
         const { id } = req.params;
         const { type, message } = await productsService.getID(id);
 
-        if (type) return res.status(404).json({ message });
+        if (false) return res.status(404).json({ message });
 
         res.status(200).json(message);
killedBy: TESTANDO O CONTROLLER PRODUTOS TESTANDO O CONTROLLER PRODUTOS Se ao digitar um id inexistente a aplicaçao quebra
statusReason: expected status to have been called with arguments 404
200 404

[Killed] BlockStatement
src/controllers/products.controller.js:17:41
         res.status(200).json(message);
 };
 
-const postProduct = async (req, res) => {
-    const { name } = req.body;
-    const { message } = await productsService.postProduct(name);
-
-    return res.status(201).json(message);
-};
+const postProduct = async (req, res) => {};
 
 const updateProduct = async (req, res) => {
killedBy: TESTANDO O CONTROLLER PRODUTOS TESTANDO O CONTROLLER PRODUTOS - ENDPOINT POST Se realiza a entrega de informações do novo produto + status 201
statusReason: expected stub to have been called with arguments 201

[Killed] BlockStatement
src/controllers/products.controller.js:24:43
     return res.status(201).json(message);
 };
 
-const updateProduct = async (req, res) => {
-    const { id } = req.params;
-    const { name } = req.body;
-    console.log(id, name);
-    const { type, message } = await productsService.updateProduct(id, name);
-    
-    if (type) {
-        return res.status(404).json({ message });
-    }
-    return res.status(200).json(message);
-};
+const updateProduct = async (req, res) => {};
 
 const deleteProduct = async (req, res) => {
killedBy: TESTANDO O CONTROLLER PRODUTOS TESTANDO O CONTROLLER PRODUTOS - ENDPOINT PUT Se atualiza um produto
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/products.controller.js:30:15
     console.log(id, name);
     const { type, message } = await productsService.updateProduct(id, name);
     
-    if (type) {
-        return res.status(404).json({ message });
-    }
+    if (type) {}
     return res.status(200).json(message);
 };
killedBy: TESTANDO O MIDDLEWARE validateFieldProduct Se ao digitar um id inexistente a aplicaçao quebra
statusReason: expected status to have been called with arguments 404
200 404

[Killed] ConditionalExpression
src/controllers/products.controller.js:30:9
     console.log(id, name);
     const { type, message } = await productsService.updateProduct(id, name);
     
-    if (type) {
+    if (false) {
         return res.status(404).json({ message });
     }
killedBy: TESTANDO O MIDDLEWARE validateFieldProduct Se ao digitar um id inexistente a aplicaçao quebra
statusReason: expected status to have been called with arguments 404
200 404

[NoCoverage] BlockStatement
src/controllers/products.controller.js:36:43
     return res.status(200).json(message);
 };
 
-const deleteProduct = async (req, res) => {
-    const { id } = req.params;
-    const { type, message } = await productsService.deleteProduct(id);
-    
-    if (type) {
-        return res.status(404).json({ message });
-    }
-    return res.status(204).json();
-};
+const deleteProduct = async (req, res) => {};
 
 module.exports = {

[NoCoverage] ConditionalExpression
src/controllers/products.controller.js:40:9
     const { id } = req.params;
     const { type, message } = await productsService.deleteProduct(id);
     
-    if (type) {
+    if (true) {
         return res.status(404).json({ message });
     }
