[Killed] BlockStatement
src/controllers/sales.controller.js:3:45
 const { salesService } = require('../services');
 
-const getAllProducts = async (_req, res) => {
-    const { message } = await salesService.getAllProducts();
-
-    res.status(200).json(message);
-};
+const getAllProducts = async (_req, res) => {};
 const getSalesByID = async (req, res) => {
         const { id } = req.params;
killedBy: TESTANDO O CONTROLLER SALES TESTANDO O CONTROLLER SALLES - área de listagem Se realiza corretamente a relação de todos os produtos
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/sales.controller.js:8:42
 
     res.status(200).json(message);
 };
-const getSalesByID = async (req, res) => {
-        const { id } = req.params;
-        const { type, message } = await salesService.getID(id);
-
-        if (type) return res.status(404).json({ message });
-
-        res.status(200).json(message);
-};
+const getSalesByID = async (req, res) => {};
 
 const getNewSale = async (req, res) => {
killedBy: TESTANDO O CONTROLLER SALES TESTANDO O CONTROLLER SALES Se ao digitar um id existente a aplicaçao continua
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/sales.controller.js:17:40
         res.status(200).json(message);
 };
 
-const getNewSale = async (req, res) => {
-    const sale = req.body;
-    const { type, message } = await salesService.getNewSale(sale);
-
-    if (type) return res.status(404).json({ message });
-
-    return res.status(201).json(message);
-};
+const getNewSale = async (req, res) => {};
 
 const deleteSale = async (req, res) => {
killedBy: TESTANDO O CONTROLLER SALES TESTANDO O CONTROLLER SALES - ENDPOINT POST Se retorna coretamente quando um id é válido
statusReason: expected stub to have been called with arguments 201

[NoCoverage] BlockStatement
src/controllers/sales.controller.js:26:40
     return res.status(201).json(message);
 };
 
-const deleteSale = async (req, res) => {
-    const { id } = req.params;
-    const { type, message } = await salesService.deleteSale(id);
-
-    if (type) {
-        return res.status(404).json({ message });
-    }
-    return res.status(204).json();
-};
+const deleteSale = async (req, res) => {};
 
 module.exports = {
