[Killed] BlockStatement
src/middlewares/validateFieldProduct.js:1:50
-const validateFieldProduct = (req, res, next) => {
-    const { name } = req.body;
-    if (!name) return res.status(400).json({ message: '"name" is required' });
-    
-    if (name.length < 5) { 
-        return res.status(422)
-        .json({ message: '"name" length must be at least 5 characters long' }); 
-    }
-    console.log('passeifield');
-    return next();
-};
+const validateFieldProduct = (req, res, next) => {};
 
 const invalidProductName = (req, res, next) => {
killedBy: TESTANDO O MIDDLEWARE validateFieldProduct Deve retornar um erro caso "name" nao seja adicionado
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateFieldProduct.js:3:9
 const validateFieldProduct = (req, res, next) => {
     const { name } = req.body;
-    if (!name) return res.status(400).json({ message: '"name" is required' });
+    if (true) return res.status(400).json({ message: '"name" is required' });
     
     if (name.length < 5) { 
killedBy: TESTANDO O MIDDLEWARE validateFieldProduct Deve retornar um erro caso "name" seja menor que 5 letras
statusReason: expected status to have been called with arguments 422
400 422

[Killed] ConditionalExpression
src/middlewares/validateFieldProduct.js:3:9
 const validateFieldProduct = (req, res, next) => {
     const { name } = req.body;
-    if (!name) return res.status(400).json({ message: '"name" is required' });
+    if (false) return res.status(400).json({ message: '"name" is required' });
     
     if (name.length < 5) { 
killedBy: TESTANDO O MIDDLEWARE validateFieldProduct Deve retornar um erro caso "name" nao seja adicionado
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/middlewares/validateFieldProduct.js:5:9
     const { name } = req.body;
     if (!name) return res.status(400).json({ message: '"name" is required' });
     
-    if (name.length < 5) { 
+    if (name.length >= 5) { 
         return res.status(422)
         .json({ message: '"name" length must be at least 5 characters long' }); 
killedBy: TESTANDO O MIDDLEWARE validateFieldProduct Deve retornar um erro caso "name" seja menor que 5 letras
statusReason: expected stub to have been called with arguments 422

[Killed] ConditionalExpression
src/middlewares/validateFieldProduct.js:5:9
     const { name } = req.body;
     if (!name) return res.status(400).json({ message: '"name" is required' });
     
-    if (name.length < 5) { 
+    if (false) { 
         return res.status(422)
         .json({ message: '"name" length must be at least 5 characters long' }); 
killedBy: TESTANDO O MIDDLEWARE validateFieldProduct Deve retornar um erro caso "name" seja menor que 5 letras
statusReason: expected stub to have been called with arguments 422

[NoCoverage] BlockStatement
src/middlewares/validateFieldProduct.js:13:48
     return next();
 };
 
-const invalidProductName = (req, res, next) => {
-    const { id } = req.params;
-    if (!id) return res.status(404).json({ message: 'Product not found' });
-    console.log('passei');
-    return next();
-};
+const invalidProductName = (req, res, next) => {};
 
 module.exports = {

[NoCoverage] ConditionalExpression
src/middlewares/validateFieldProduct.js:15:9
 
 const invalidProductName = (req, res, next) => {
     const { id } = req.params;
-    if (!id) return res.status(404).json({ message: 'Product not found' });
+    if (true) return res.status(404).json({ message: 'Product not found' });
     console.log('passei');
     return next();

[NoCoverage] BooleanLiteral
src/middlewares/validateFieldProduct.js:15:9
 
 const invalidProductName = (req, res, next) => {
     const { id } = req.params;
-    if (!id) return res.status(404).json({ message: 'Product not found' });
+    if (id) return res.status(404).json({ message: 'Product not found' });
     console.log('passei');
     return next();
