[Killed] BlockStatement
src/models/products.model.js:3:28
 const connection = require('./connection');
 
-const getAll = async () => {
-    const [products] = await connection.execute('SELECT * FROM StoreManager.products');
-    return products;
-};
+const getAll = async () => {};
 
 const getID = async (id) => {
killedBy: TESTANDO O MODEL PRODUTOS MODEL PRODUTOS/GET Se todos os produtos são listados
statusReason: expected undefined to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/models/products.model.js:8:29
     return products;
 };
 
-const getID = async (id) => {
-    const [[productId]] = await connection.execute(
-    'SELECT * FROM StoreManager.products WHERE id = ?',
-    [id],
-    );
-
-    return productId;
-};
+const getID = async (id) => {};
 
 const postProduct = async (name) => {
killedBy: TESTANDO O MODEL PRODUTOS MODEL PRODUTOS/GET Se o id digitado corresponde a pessoa certa
statusReason: expected undefined to deeply equal { id: 1, name: 'Martelo de Thor' }

[Killed] BlockStatement
src/models/products.model.js:17:37
     return productId;
 };
 
-const postProduct = async (name) => {
-    await connection.execute(
-        'INSERT INTO StoreManager.products (name) VALUE (?)',
-        [name],    
-    );
-    
-    const [[product]] = await connection.execute(
-        'SELECT * FROM StoreManager.products WHERE name = ?',
-        [name],
-        );
-
-        return product;
-};
+const postProduct = async (name) => {};
 
 const allProductId = async () => {
killedBy: TESTANDO O MODEL PRODUTOS MODEL PRODUTOS/POST Se um produto é cadastrado corretamente
statusReason: expected undefined to deeply equal { name: 'Travesseiro de Pedra' }

[NoCoverage] BlockStatement
src/models/products.model.js:31:34
         return product;
 };
 
-const allProductId = async () => {
-    const [[{ id }]] = await connection.execute(
-        'SELECT MAX(id) AS id FROM products',
-    );
-    return id;
-};
+const allProductId = async () => {};
 
 const updateProduct = async (id, name) => {

[Killed] BlockStatement
src/models/products.model.js:38:43
     return id;
 };
 
-const updateProduct = async (id, name) => {
-   const [pid] = await connection.execute(
-        `UPDATE products SET name = ?
-        WHERE id = ?`,
-        [name, id],
-    );
-    
-    return pid;
-};
+const updateProduct = async (id, name) => {};
 
 const deleteProduct = async (idProduct) => {
killedBy: TESTANDO O MODEL PRODUTOS MODEL PRODUTOS/PUT Se um produto é atualizado corretamente
statusReason: expected undefined to deeply equal [ { id: 1, name: 'Havaiana' } ]

[Killed] BlockStatement
src/models/products.model.js:48:44
     return pid;
 };
 
-const deleteProduct = async (idProduct) => {
-    const [id] = await connection.execute(
-        'DELETE FROM StoreManager.products WHERE id = ?;',
-        [idProduct],
-    );
-    return id;
-};
+const deleteProduct = async (idProduct) => {};
 
 module.exports = {
killedBy: TESTANDO O MODEL PRODUTOS MODEL PRODUTOS/DELETE Se um produto é deletado corretamente
statusReason: expected undefined to equal 1
