[Killed] BlockStatement
src/models/sales.model.js:3:28
 const connection = require('./connection');
 
-const getAll = async () => {
-    const [sales] = await connection.execute(
-    `SELECT 
-    sp.sale_id AS saleId, 
-    s.date, 
-    sp.product_id AS productId, 
-    sp.quantity 
-    FROM StoreManager.sales_products AS sp 
-    INNER JOIN StoreManager.sales AS s
-    ON sp.sale_id = s.id
-    ORDER BY sp.sale_id, sp.product_id`,
-    );
-    return sales;
-};
+const getAll = async () => {};
 const getID = async (id) => {
     const [salesId] = await connection.execute(
killedBy: TESTANDO O MODEL SALES Se todos os produtos são listados
statusReason: expected undefined to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/models/sales.model.js:17:29
     );
     return sales;
 };
-const getID = async (id) => {
-    const [salesId] = await connection.execute(
-    `SELECT s.date, sp.product_id AS productId, sp.quantity
-    FROM StoreManager.sales_products AS sp
-    INNER JOIN StoreManager.sales AS s
-    ON sp.sale_id = s.id
-    WHERE sale_id = ?;`,
-    [id],
-    );
-    return salesId;
-};
+const getID = async (id) => {};
 
 const postProductInSale = async (created, sale) => {
killedBy: TESTANDO O MODEL SALES Se o id digitado corresponde a venda certa
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/models/sales.model.js:29:52
     return salesId;
 };
 
-const postProductInSale = async (created, sale) => {
-    await connection.execute(
-        'INSERT INTO sales_products (sale_id, product_id, quantity) VALUES (?, ?, ?)',
-        [created, sale.productId, sale.quantity],
-    );
-
-    const [result] = await connection.execute(
-        `SELECT product_id AS productId, quantity
-        FROM sales_products WHERE sale_id = ?`,
-        [created],
-    );
-    return result;
-};
+const postProductInSale = async (created, sale) => {};
 
 const createIdSale = async () => {
killedBy: TESTANDO O MODEL SALES MODEL SALES - POST MODEL Cadastrando uma venda
statusReason: expected undefined to equal 34

[Killed] BlockStatement
src/models/sales.model.js:43:34
     return result;
 };
 
-const createIdSale = async () => {
-    const [{ insertId }] = await connection.execute(
-        'INSERT INTO sales (date) VALUES (DEFAULT);',
-    );
-    return insertId;
-};
+const createIdSale = async () => {};
 
 const salePost = async () => {
killedBy: TESTANDO O MODEL SALES MODEL SALES - POST MODEL Se possui ID
statusReason: expected undefined to equal 34

[NoCoverage] BlockStatement
src/models/sales.model.js:50:30
     return insertId;
 };
 
-const salePost = async () => {
-    const [{ insertId }] = await connection.execute(
-        'INSERT INTO sales (date) VALUES (NOW())',
-    );
-        return insertId;
-};
+const salePost = async () => {};
 
 const deleteSale = async (id) => {

[NoCoverage] BlockStatement
src/models/sales.model.js:57:34
         return insertId;
 };
 
-const deleteSale = async (id) => {
-    const [sid] = await connection.execute(
-        'DELETE FROM sales WHERE id = ?;',
-        [id],
-      );
-    
-      return sid;
-};
+const deleteSale = async (id) => {};
 
 module.exports = {
