[Killed] BlockStatement
src/services/products.service.js:3:36
 const { productsModel } = require('../models');
 
-const getAllProducts = async () => {
-    const allProducts = await productsModel.getAll();
-    return { type: null, message: allProducts };
-};
+const getAllProducts = async () => {};
 
 const getID = async (productId) => {
killedBy: TESTANDO O SERVICE PRODUTOS TESTANDO O SERVICE PRODUTOS - LISTAGEM todos os produtos são listados
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/services/products.service.js:8:36
     return { type: null, message: allProducts };
 };
 
-const getID = async (productId) => {
-    const idList = await productsModel.getID(productId);
-
-    if (!idList) return { type: 404, message: 'Product not found' };
-    
-    return { type: null, message: idList };
-};
+const getID = async (productId) => {};
 
 const postProduct = async (name) => {
killedBy: TESTANDO O SERVICE PRODUTOS TESTANDO O SERVICE PRODUTOS - PRODUTO ESPECÍFICO Se nao existir
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/services/products.service.js:11:9
 const getID = async (productId) => {
     const idList = await productsModel.getID(productId);
 
-    if (!idList) return { type: 404, message: 'Product not found' };
+    if (false) return { type: 404, message: 'Product not found' };
     
     return { type: null, message: idList };
killedBy: TESTANDO O SERVICE PRODUTOS TESTANDO O SERVICE PRODUTOS - PRODUTO ESPECÍFICO Se nao existir
statusReason: expected null to equal 404

[Killed] BooleanLiteral
src/services/products.service.js:11:9
 const getID = async (productId) => {
     const idList = await productsModel.getID(productId);
 
-    if (!idList) return { type: 404, message: 'Product not found' };
+    if (idList) return { type: 404, message: 'Product not found' };
     
     return { type: null, message: idList };
killedBy: TESTANDO O SERVICE PRODUTOS TESTANDO O SERVICE PRODUTOS - PRODUTO ESPECÍFICO Se nao existir
statusReason: expected null to equal 404

[Killed] BlockStatement
src/services/products.service.js:16:37
     return { type: null, message: idList };
 };
 
-const postProduct = async (name) => {
-    const postNewProduct = await productsModel.postProduct(name);
-    return { type: null, message: postNewProduct };
-};
+const postProduct = async (name) => {};
 const updateProduct = async (id, name) => {
     await productsModel.updateProduct(id, name);
killedBy: TESTANDO O SERVICE PRODUTOS TESTANDO O SERVICE PRODUTOS - ENDPOINT POST Se a validação do produto é feita de forma correta
statusReason: Cannot read properties of undefined (reading 'type')

[NoCoverage] BlockStatement
src/services/products.service.js:20:43
     const postNewProduct = await productsModel.postProduct(name);
     return { type: null, message: postNewProduct };
 };
-const updateProduct = async (id, name) => {
-    await productsModel.updateProduct(id, name);
-    const productUpdt = await productsModel.getID(id);
-    if (!productUpdt) return { type: 404, message: 'Product not found' };
-    console.log('passei no service');
-    return { type: null, message: productUpdt };
-};
+const updateProduct = async (id, name) => {};
 
 const deleteProduct = async (id) => {

[NoCoverage] ConditionalExpression
src/services/products.service.js:23:9
 const updateProduct = async (id, name) => {
     await productsModel.updateProduct(id, name);
     const productUpdt = await productsModel.getID(id);
-    if (!productUpdt) return { type: 404, message: 'Product not found' };
+    if (true) return { type: 404, message: 'Product not found' };
     console.log('passei no service');
     return { type: null, message: productUpdt };

[NoCoverage] BooleanLiteral
src/services/products.service.js:23:9
 const updateProduct = async (id, name) => {
     await productsModel.updateProduct(id, name);
     const productUpdt = await productsModel.getID(id);
-    if (!productUpdt) return { type: 404, message: 'Product not found' };
+    if (productUpdt) return { type: 404, message: 'Product not found' };
     console.log('passei no service');
     return { type: null, message: productUpdt };

[Killed] BlockStatement
src/services/products.service.js:28:37
     return { type: null, message: productUpdt };
 };
 
-const deleteProduct = async (id) => {
-    const search = await productsModel.getID(id);
-    if (!search) return { type: 404, message: 'Product not found' };
-    
-    await productsModel.deleteProduct(id);
-    
-    return { type: null, message: null };
-};
+const deleteProduct = async (id) => {};
 
 module.exports = {
killedBy: TESTANDO O SERVICE PRODUTOS TESTANDO O SERVICE PRODUTOS - ENDPOINT DELETE A exclusão do produto é feita de forma correta dada as informações
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/services/products.service.js:30:9
 
 const deleteProduct = async (id) => {
     const search = await productsModel.getID(id);
-    if (!search) return { type: 404, message: 'Product not found' };
+    if (true) return { type: 404, message: 'Product not found' };
     
     await productsModel.deleteProduct(id);
killedBy: TESTANDO O SERVICE PRODUTOS TESTANDO O SERVICE PRODUTOS - ENDPOINT DELETE A exclusão do produto é feita de forma correta dada as informações
statusReason: expected 404 to equal null

[Killed] BooleanLiteral
src/services/products.service.js:30:9
 
 const deleteProduct = async (id) => {
     const search = await productsModel.getID(id);
-    if (!search) return { type: 404, message: 'Product not found' };
+    if (search) return { type: 404, message: 'Product not found' };
     
     await productsModel.deleteProduct(id);
killedBy: TESTANDO O SERVICE PRODUTOS TESTANDO O SERVICE PRODUTOS - ENDPOINT DELETE A exclusão do produto é feita de forma correta dada as informações
statusReason: expected 404 to equal null
