[Killed] BlockStatement
src/services/sales.service.js:3:36
 const { salesModel, productsModel } = require('../models');
 
-const getAllProducts = async () => {
-    const allProducts = await salesModel.getAll();
-    return { type: null, message: allProducts };
-};
+const getAllProducts = async () => {};
 
 const getID = async (id) => {
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE PRODUTOS - LISTAGEM todos os produtos são listados
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/services/sales.service.js:8:29
     return { type: null, message: allProducts };
 };
 
-const getID = async (id) => {
-    const idList = await salesModel.getID(id);
-
-    if (!idList || idList.length === 0) return { type: 404, message: 'Sale not found' };
-    
-    return { type: null, message: idList };
-};
+const getID = async (id) => {};
 
 const getNewSale = async (s) => {
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE SALES - PRODUTO ESPECÍFICO Se nao existir
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/services/sales.service.js:11:9
 const getID = async (id) => {
     const idList = await salesModel.getID(id);
 
-    if (!idList || idList.length === 0) return { type: 404, message: 'Sale not found' };
+    if (true) return { type: 404, message: 'Sale not found' };
     
     return { type: null, message: idList };
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE SALES - PRODUTO ESPECÍFICO Se o id digitado corresponde ao produto correto
statusReason: expected 'Sale not found' to deeply equal { Object (date, productId, ...) }

[Killed] BooleanLiteral
src/services/sales.service.js:11:9
 const getID = async (id) => {
     const idList = await salesModel.getID(id);
 
-    if (!idList || idList.length === 0) return { type: 404, message: 'Sale not found' };
+    if (idList || idList.length === 0) return { type: 404, message: 'Sale not found' };
     
     return { type: null, message: idList };
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE SALES - PRODUTO ESPECÍFICO Se nao existir
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/services/sales.service.js:16:33
     return { type: null, message: idList };
 };
 
-const getNewSale = async (s) => {
-    const getIdProduct = s.map((product) => productsModel.getID(product.productId));
-    const getIdResult = await Promise.all(getIdProduct);
-    const undefinedProduct = getIdResult.every((id) => id !== undefined);
-
-    if (!undefinedProduct) return { type: 'product not found', message: 'Product not found' };
-
-    const created = await salesModel.createIdSale();
-
-    const sales = s.map((sale) => salesModel.postProductInSale(created, sale));
-    const result = await Promise.all(sales);
-    const resultMessage = { type: null, message: { id: created, itemsSold: result[1] } };
-
-    return resultMessage;
-};
+const getNewSale = async (s) => {};
 
 const deleteSale = async (id) => {
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE SALES - ENDPOINT POST Se cria uma venda
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/services/sales.service.js:19:56
 const getNewSale = async (s) => {
     const getIdProduct = s.map((product) => productsModel.getID(product.productId));
     const getIdResult = await Promise.all(getIdProduct);
-    const undefinedProduct = getIdResult.every((id) => id !== undefined);
+    const undefinedProduct = getIdResult.every((id) => false);
 
     if (!undefinedProduct) return { type: 'product not found', message: 'Product not found' };
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE SALES - ENDPOINT POST Se cria uma venda
statusReason: expected 'product not found' to equal null

[Killed] EqualityOperator
src/services/sales.service.js:19:56
 const getNewSale = async (s) => {
     const getIdProduct = s.map((product) => productsModel.getID(product.productId));
     const getIdResult = await Promise.all(getIdProduct);
-    const undefinedProduct = getIdResult.every((id) => id !== undefined);
+    const undefinedProduct = getIdResult.every((id) => id === undefined);
 
     if (!undefinedProduct) return { type: 'product not found', message: 'Product not found' };
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE SALES - ENDPOINT POST Se cria uma venda
statusReason: expected 'product not found' to equal null

[Killed] ConditionalExpression
src/services/sales.service.js:21:9
     const getIdResult = await Promise.all(getIdProduct);
     const undefinedProduct = getIdResult.every((id) => id !== undefined);
 
-    if (!undefinedProduct) return { type: 'product not found', message: 'Product not found' };
+    if (true) return { type: 'product not found', message: 'Product not found' };
 
     const created = await salesModel.createIdSale();
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE SALES - ENDPOINT POST Se cria uma venda
statusReason: expected 'product not found' to equal null

[Killed] BooleanLiteral
src/services/sales.service.js:21:9
     const getIdResult = await Promise.all(getIdProduct);
     const undefinedProduct = getIdResult.every((id) => id !== undefined);
 
-    if (!undefinedProduct) return { type: 'product not found', message: 'Product not found' };
+    if (undefinedProduct) return { type: 'product not found', message: 'Product not found' };
 
     const created = await salesModel.createIdSale();
killedBy: TESTANDO O SERVICE SALES TESTANDO O SERVICE SALES - ENDPOINT POST Se cria uma venda
statusReason: expected 'product not found' to equal null

[NoCoverage] BlockStatement
src/services/sales.service.js:32:34
     return resultMessage;
 };
 
-const deleteSale = async (id) => {
-    const idList = await salesModel.getID(id);
-    
-    if (idList.length === 0) return { type: 404, message: 'Sale not found' };
-    
-    await salesModel.deleteSale(id);
-    
-    return { type: null, message: null };
-};
+const deleteSale = async (id) => {};
 
 module.exports = {

[NoCoverage] EqualityOperator
src/services/sales.service.js:35:9
 const deleteSale = async (id) => {
     const idList = await salesModel.getID(id);
     
-    if (idList.length === 0) return { type: 404, message: 'Sale not found' };
+    if (idList.length !== 0) return { type: 404, message: 'Sale not found' };
     
     await salesModel.deleteSale(id);

[NoCoverage] ConditionalExpression
src/services/sales.service.js:35:9
 const deleteSale = async (id) => {
     const idList = await salesModel.getID(id);
     
-    if (idList.length === 0) return { type: 404, message: 'Sale not found' };
+    if (false) return { type: 404, message: 'Sale not found' };
     
     await salesModel.deleteSale(id);
