[Killed] BlockStatement
src/middlewares/validateSalesError.js:1:43
-const validateSales = (req, res, next) => {
-    const sale = req.body;
-    const products = sale.every((product) => product.productId !== undefined);
-
-    if (!products) {
-        return res.status(400).json({ message: '"productId" is required', 
-    }); 
-}
-    return next();
-};
+const validateSales = (req, res, next) => {};
 
 const invalidQuantitySales = (req, res, next) => {
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar: "productId" is required além do status 400
statusReason: expected stub to have been called with arguments 400

[Killed] MethodExpression
src/middlewares/validateSalesError.js:3:22
 const validateSales = (req, res, next) => {
     const sale = req.body;
-    const products = sale.every((product) => product.productId !== undefined);
+    const products = sale.some(product => product.productId !== undefined);
 
     if (!products) {
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar: "productId" is required além do status 400
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateSalesError.js:3:46
 const validateSales = (req, res, next) => {
     const sale = req.body;
-    const products = sale.every((product) => product.productId !== undefined);
+    const products = sale.every((product) => true);
 
     if (!products) {
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar: "productId" is required além do status 400
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateSalesError.js:5:9
     const sale = req.body;
     const products = sale.every((product) => product.productId !== undefined);
 
-    if (!products) {
+    if (false) {
         return res.status(400).json({ message: '"productId" is required', 
     }); 
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar: "productId" is required além do status 400
statusReason: expected stub to have been called with arguments 400

[Killed] BlockStatement
src/middlewares/validateSalesError.js:5:20
     const sale = req.body;
     const products = sale.every((product) => product.productId !== undefined);
 
-    if (!products) {
-        return res.status(400).json({ message: '"productId" is required', 
-    }); 
-}
+    if (!products) {}
     return next();
 };
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar: "productId" is required além do status 400
statusReason: expected stub to have been called with arguments 400

[Killed] BlockStatement
src/middlewares/validateSalesError.js:12:50
     return next();
 };
 
-const invalidQuantitySales = (req, res, next) => {
-    const sale = req.body;
-    const products = sale.every((product) => product.quantity !== undefined);
-    if (!products) {
-        return res.status(400).json({ message: '"quantity" is required', 
-        }); 
-    }
-        
-const quantitySalesValue = sale.every((q) => q.quantity > 0);
-    if (!quantitySalesValue) {
-        return res.status(422).json({ 
-        message: '"quantity" must be greater than or equal to 1',
-        }); 
-    } 
-    return next();
-};
+const invalidQuantitySales = (req, res, next) => {};
 
 module.exports = {
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem 'Quantity must be greater than or equal to 1'
       além do status 422
statusReason: expected stub to have been called with arguments 422

[Killed] EqualityOperator
src/middlewares/validateSalesError.js:14:46
 
 const invalidQuantitySales = (req, res, next) => {
     const sale = req.body;
-    const products = sale.every((product) => product.quantity !== undefined);
+    const products = sale.every((product) => product.quantity === undefined);
     if (!products) {
         return res.status(400).json({ message: '"quantity" is required', 
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem 'Quantity must be greater than or equal to 1'
       além do status 422
statusReason: expected status to have been called with arguments 422
400 422

[Killed] ConditionalExpression
src/middlewares/validateSalesError.js:14:46
 
 const invalidQuantitySales = (req, res, next) => {
     const sale = req.body;
-    const products = sale.every((product) => product.quantity !== undefined);
+    const products = sale.every((product) => false);
     if (!products) {
         return res.status(400).json({ message: '"quantity" is required', 
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem 'Quantity must be greater than or equal to 1'
       além do status 422
statusReason: expected status to have been called with arguments 422
400 422

[Killed] BlockStatement
src/middlewares/validateSalesError.js:15:20
 const invalidQuantitySales = (req, res, next) => {
     const sale = req.body;
     const products = sale.every((product) => product.quantity !== undefined);
-    if (!products) {
-        return res.status(400).json({ message: '"quantity" is required', 
-        }); 
-    }
+    if (!products) {}
         
 const quantitySalesValue = sale.every((q) => q.quantity > 0);
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem '"quantity" is required'
       além do status 400
statusReason: expected status to have been called with arguments 400
422 400

[Killed] ConditionalExpression
src/middlewares/validateSalesError.js:15:9
 const invalidQuantitySales = (req, res, next) => {
     const sale = req.body;
     const products = sale.every((product) => product.quantity !== undefined);
-    if (!products) {
+    if (true) {
         return res.status(400).json({ message: '"quantity" is required', 
         }); 
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem 'Quantity must be greater than or equal to 1'
       além do status 422
statusReason: expected status to have been called with arguments 422
400 422

[Killed] EqualityOperator
src/middlewares/validateSalesError.js:20:46
         }); 
     }
         
-const quantitySalesValue = sale.every((q) => q.quantity > 0);
+const quantitySalesValue = sale.every((q) => q.quantity <= 0);
     if (!quantitySalesValue) {
         return res.status(422).json({ 
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem 'Quantity must be greater than or equal to 1'
       além do status 422
statusReason: expected stub to have been called with arguments 422

[Killed] ConditionalExpression
src/middlewares/validateSalesError.js:20:46
         }); 
     }
         
-const quantitySalesValue = sale.every((q) => q.quantity > 0);
+const quantitySalesValue = sale.every((q) => true);
     if (!quantitySalesValue) {
         return res.status(422).json({ 
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem 'Quantity must be greater than or equal to 1'
       além do status 422
statusReason: expected stub to have been called with arguments 422

[Killed] BlockStatement
src/middlewares/validateSalesError.js:21:30
     }
         
 const quantitySalesValue = sale.every((q) => q.quantity > 0);
-    if (!quantitySalesValue) {
-        return res.status(422).json({ 
-        message: '"quantity" must be greater than or equal to 1',
-        }); 
-    } 
+    if (!quantitySalesValue) {} 
     return next();
 };
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem 'Quantity must be greater than or equal to 1'
       além do status 422
statusReason: expected stub to have been called with arguments 422

[Killed] ConditionalExpression
src/middlewares/validateSalesError.js:21:9
     }
         
 const quantitySalesValue = sale.every((q) => q.quantity > 0);
-    if (!quantitySalesValue) {
+    if (false) {
         return res.status(422).json({ 
         message: '"quantity" must be greater than or equal to 1',
killedBy: TESTANDO O MIDDLEWARE - validateSalesError Dados inválidos enviados Deve retornar mensagem 'Quantity must be greater than or equal to 1'
       além do status 422
statusReason: expected stub to have been called with arguments 422
